app/controllers/admin_controller.rb

  def index
    #For Opening the admin Dashboard
User.create(:id=>7, :fullname=>"Rajan", :username=>"rajan15", :password=>"rajan15")
    @id=params[:id] ? params[:id] :0
    @users=User.all
---
INSERT INTO "users" ("created_at", "fullname", "password", "updated_at", "username", "usertype") VALUES ('2016-04-04 07:14:41.547779', 'Rajan', 'rajan15', '2016-04-04 07:14:41.547779', 'rajan15', NULL)
SELECT "users".* FROM "users"

  def save_user
    #This is for saving new user
    @username=params[:username] ? params[:username] : Array.new
    @password=params[:password] ? params[:password] : Array.new
    @fullname=params[:fullname] ? params[:fullname] : ""
    @usertype=params[:usertype] ? params[:usertype] : ""
    user=User.create(:username=> @username, :password=>@password, :usertype=>@usertype, :usertype=>@usertype, :fullname=>@fullname)
---
INSERT INTO "users" ("created_at", "fullname", "password", "updated_at", "username", "usertype") VALUES ('2016-04-04 07:05:29.415172', 'prats', 'prats17', '2016-04-04 07:05:29.415172', 'prats17', 'creator')

  def publishMain
    recipe_id=params[:recipe_id] ? params[:recipe_id] : 0
    recipe=Recipe.where(:id=>recipe_id).update_all(:publish_status => "Display")
---
UPDATE "recipes" SET "publish_status" = 'Display' WHERE ("recipes"."id" = 20)