app/controllers/user_info_controller.rb

  def index
    #For Displaying all the Eligible Recipes on Main Page.
    @recipes=Recipe.where(:publish_status=>"Display").order("updated_at DESC").take(5)
---
SELECT "recipes".* FROM "recipes" WHERE ("recipes"."publish_status" = 'Display') ORDER BY updated_at DESC

  def login_test
    #This is for Opening the login page.
    username=params[:username] ? params[:username] : ""
    password=params[:password] ? params[:password] : ""
    usertype=params[:usertype] ? params[:usertype].downcase : ""
    users=User.all
---
SELECT "users".* FROM "users" WHERE (username = 'pratik17' AND password = 'M@lanG17' AND usertype='creator') ORDER BY users.id DESC LIMIT 1

  def dashboard1
    #Creator Dashboard
    @id=params[:id] ? params[:id] : 0
    @recipes_info=Recipe.where("user_id = ?", @id)
---
SELECT "recipes".* FROM "recipes" WHERE (user_id = '1')

  def dashboard2
    #dashboard for Moderator
    @moderator_id=params[:id] ? params[:id] : 0
    @recipes_info_publish=Recipe.where("publish_status = ?", "No Published")
---
SELECT "recipes".* FROM "recipes" WHERE (publish_status = 'No Published')

  def save_recipes
    #Saving the New Recipe
    @ingredient=params[:ingredient] ? params[:ingredient] : Array.new
    @quantity=params[:quantity] ? params[:quantity] : Array.new
    @user_id=params[:user_id] ? params[:user_id] : 0
    @recipe_name=params[:recipe_name] ? params[:recipe_name] : ""
    @steps=params[:steps] ? params[:steps] : ""
    ingre_quan=Array.new
    @ingredient.length.times do |x|
      ingre_quan.push(@ingredient[x] + "|" + @quantity[x])
    end
    recipe=Recipe.create("ingredient1"=>ingre_quan[0],"ingredient2"=>ingre_quan[1],"ingredient3"=>ingre_quan[2],"ingredient4"=>ingre_quan[3],"ingredient5"=>ingre_quan[4],"ingredient6"=>ingre_quan[5],"ingredient7"=>ingre_quan[6],"recipe_name"=>@recipe_name,"publish_status"=>"No Published","user_id"=>@user_id, "steps"=>@steps)
---
INSERT INTO "recipes" ("created_at", "ingredient1", "ingredient2", "ingredient3", "ingredient4", "ingredient5", "ingredient6", "ingredient7", "publish_status", "recipe_name", "steps", "updated_at", "user_id") VALUES ('2016-04-04 07:16:22.648093', 'test|test', NULL, NULL, NULL, NULL, NULL, NULL, 'No Published', 'testrecipe', 'test recipe', '2016-04-04 07:16:22.648093', '6')

  def update_recipes
    #Updating the recipe
    @ingredient_edited=params[:ingredient] ? params[:ingredient] : Array.new
    @quantity_edited=params[:quantity] ? params[:quantity] : Array.new
    @recipe_id=params[:recipe_id] ? params[:recipe_id] : ""
    @user_id=params[:user_id] ? params[:user_id] : 0
    @steps=params[:steps] ? params[:steps] : ""
    ingre_quan=Array.new
    @ingredient_edited.length.times do |x|
      ingre_quan.push(@ingredient_edited[x] + "|" + @quantity_edited[x])
    end
    recipe_find=Recipe.where("id = ?" ,@recipe_id)
    recipe_find.update_all("ingredient1"=>ingre_quan[0],"ingredient2"=>ingre_quan[1],"ingredient3"=>ingre_quan[2],"ingredient4"=>ingre_quan[3],"ingredient5"=>ingre_quan[4],"ingredient6"=>ingre_quan[5],"ingredient7"=>ingre_quan[6],"publish_status"=>"Published", "steps"=>@steps)
---
UPDATE "recipes" SET "ingredient1" = 'Rice|1 cup', "ingredient2" = 'Water|1 cup', "ingredient3" = 'Salt|1 tbsp', "ingredient4" = 'Turmeric|1/6 tbsp', "ingredient5" = 'chilly powder|1/8 tbsp', "ingredient6" = NULL, "ingredient7" = NULL, "publish_status" = 'Published', "steps" = ' ' WHERE (id = '22')